{"intents":
[
  {"tag": "greetings", "patterns":  ["hi","hey", "hello", "how are you", "how is it going", "what's up", "wassup"], "responses": ["Hi, How's it going!", "Hey there!, How may I help u today?", "Good day to you!. How can I assist you today?"]},
  {"tag": "goodbye", "patterns": ["bye","thanks","goodbye","see you","have a good day","ciao"], "responses": ["Thank you for using Watex! We hope you had a pleasant experience","Goodbye! Hope you had a good experience with me."]},
  {"tag": "name", "patterns": ["what should I call you","what is your name","who are you", "whats your name"], "responses": ["I'm Watex, your friendly Enviro-conscious bot!","I'm Watex and I'm here to assist you"]},
  {"tag": "info", "patterns":  ["what all do you know", "what can you tell me", "what information do you have"], "responses": ["I have information for you on water bodies like rivers, ponds, oceans and lakes."]},
  {"tag": "riverintro", "patterns": ["what can you tell me about rivers","tell me about rivers","what are rivers","what is a river","whats a river"], "responses": ["A river is a natural flowing watercourse, usually a freshwater stream, that flows on the surface or inside caves towards another waterbody at a lower elevation. They usually originate from mountains and terminate in seas or oceans. Their flow is driven by gravity."]},
  {"tag": "pondintro", "patterns": ["what can you tell me about ponds","tell me about ponds","what are ponds","what is a pond","whats a pond"], "responses": ["A pond is a small, still, land-based body of water formed by pooling inside a depression, either naturally or artificially. It is smaller than a lake and has a small area, less than 5 hectares in area, less than 5 meters in depth, and with less than 30% of its surface covered by emergent vegetation."]},
  {"tag": "lakeintro", "patterns": ["what can you tell me about lakes","tell me about lakes","what are lakes","what is a lake","whats a lake"], "responses": ["A lake is a naturally occurring, relatively large body of water located in a basin surrounded by dry land. They are found on every continent and in every kind of environment. Lakes are an important component of the natural water cycle, serving as large standing pools of storage water."]},
  {"tag": "oceanintro", "patterns": ["what can you tell me about oceans","tell me about oceans","what are oceans","what is an ocean","whats an ocean"], "responses": ["An ocean, also known as the sea or the world ocean, is a body of salt water that covers approximately 70.8% of the Earth's surface and contains 97% of Earth's water. It is a far larger body of open water than a sea. The ocean is divided into four principal geographical divisions: the Atlantic, Pacific, Indian, or Arctic oceans."]},
  {"tag": "impwater", "patterns": ["why are oceans important","how are oceans important","why should we save oceans","importance of oceans","why are rivers important","how are rivers important","why should we save rivers","importance of rivers","why are lakes important","how are lakes important","why should we save lakes","importance of lakes","why are ponds important","how are ponds important","why should we save ponds","importance of ponds"], "responses": ["Rivers, ponds, oceans and lakes are responsible for playing an integral part in supporting life. They provide living beings with water for survival, support a huge variety of aquatic species, help maintain the ecosystem in different sphere, contribute in the water cycle, help regulate the earth's temperature and much more! Therefore, it should be our aim to put in as much efforts as we can to save these precious water bodies."]},
  {"tag": "causes", "patterns": ["what are the causes of river pollution","what are the causes of ocean pollution","what are the causes of pond pollution","what are the causes of lake pollution","what are the causes of pollution of water bodies","what are the causes of pollution of rivers","what are the causes of pollution of oceans","what are the causes of pollution of lakes","what are the causes of pollution of ponds","how are water bodies getting polluted","why are water bodies getting polluted","what are the causes of water pollution","whats causing water pollution","what is water pollution","whats water pollution","whats causing water pollution"],"responses": ["Water pollution is the release of substances into bodies of water that makes water unsafe for human use and disrupts aquatic ecosystems. It can be caused by a plethora of different contaminants, including toxic waste, petroleum, and disease-causing microorganisms. Sources of water pollution are either point sources or non-point sources. Point sources have one identifiable cause, such as a storm drain, a wastewater treatment plant, or an oil spill, while non-point sources are more diffuse, such as agricultural runoff. Nutrient pollution, caused by excess nitrogen and phosphorus in water or air, is the number-one threat to water quality worldwide and can cause algal blooms, a toxic soup of blue-green algae that can be harmful to people and wildlife. The main point source of pollution to water is from sewage and waste water treatment, while for diffuse pollution, the main sources are from farming and fossil fuel power plants (via the air)."]},
  {"tag": "prevention", "patterns": ["how can we save water bodies","how can we stop river pollution","how can we stop ocean pollution","how can we stop pond pollution","how can we stop lake pollution","how to prevent water pollution","how can we prevent pollution of water bodies","how can we clean water bodies", "how can we clean rivers", "how can we clean oceans", "how can we clean ponds","how can we clean lakes","how to save water","how can we treat water"], "responses": ["Water pollution, to a larger extent, can be controlled by a variety of methods. Rather than releasing sewage waste into water bodies, it is better to treat them before discharge. Practising this can reduce the initial toxicity and the remaining substances can be degraded and rendered harmless by the water body itself. If the secondary treatment of water has been carried out, then this can be reused in sanitary systems and agricultural fields. A very special plant, the Water Hyacinth can absorb dissolved toxic chemicals such as cadmium and other such elements. Establishing these in regions prone to such kinds of pollutants will reduce the adverse effects to a large extent. Some chemical methods that help in the control of water pollution are precipitation, the ion exchange process, reverse osmosis, and coagulation. As an individual, reusing, reducing, and recycling wherever possible will advance a long way in overcoming the effects of water pollution."]},
  {"tag": "effects", "patterns": ["what problems are caused by water pollution","what problems occur due to pollution of water bodies","why is the pollution of water bodies concerning","how is the pollution of water bodies a problem","what are the effects of water pollution","what happens due to pollution of water bodies","why is the pollution of water bodies a problem","why do we need to clean water bodies", "why do we need to save water bodies"], "responses": ["The effect of water pollution depends upon the type of pollutants and their concentration. Water bodies in the vicinity of urban areas are extremely polluted. This is the result of dumping garbage and toxic chemicals by industrial and commercial establishments. Water pollution drastically affects aquatic life. It affects their metabolism, and behaviour, and causes illness and eventual death. Dioxin is a chemical that causes a lot of problems from reproduction to uncontrolled cell growth or cancer. This chemical is bioaccumulated in fish, chicken and meat. Chemicals such as this travel up the food chain before entering the human body. The effect of water pollution can have a huge impact on the food chain. It disrupts the food chain. Cadmium and lead are some toxic substances, these pollutants upon entering the food chain through animals (fish when consumed by animals, humans) can continue to disrupt at higher levels. Humans are affected by pollution and can contract diseases such as hepatitis through faecal matter in water sources. Poor drinking water treatment and unfit water can always cause an outbreak of infectious diseases such as cholera, etc. The ecosystem can be critically affected, modified and destructured because of water pollution."]},
  {"tag": "funfact", "patterns": ["tell me something fun","give me a fun fact", "tell me something fun about water bodies,"], "responses": ["Did you know that approximately 400 billion gallons of water are used in the United States per day.","Did you know that the loudest ocean sound ever came from an icequake","Did you know that the depth of oceans is so great that even a single ray of light cannot penetrate beyond a certain point.","Did you know that despite all the advancements in technology, we have barely been able to explore water bodies."]}
]
}
